tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1717_tdd.h
#define SP1BRGH                       522
#define RC1STA                        523
#define RX9D                          524
#define OERR                          525
#define FERR                          526
#define ADDEN                         527
#define CREN                          528
#define SREN                          529
#define RX9                           530
#define SPEN                          531
#define TX1STA                        532
#define TX9D                          533
#define TRMT                          534
#define BRGH                          535
#define SENDB                         536
#define SYNC                          537
#define TXEN                          538
#define TX9                           539
#define CSRC                          540
#define BAUD1CON                      541
#define ABDEN                         542
#define WUE                           543
#define BRG16                         544
#define SCKP                          545
#define RCIDL                         546
#define ABDOVF                        547
#define WPUA                          548
#define WPUA0                         549
#define WPUA1                         550
#define WPUA2                         551
#define WPUA3                         552
#define WPUA4                         553
#define WPUA5                         554
#define WPUA6                         555
#define WPUA7                         556
#define WPUB                          557
#define WPUB0                         558
#define WPUB1                         559
#define WPUB2                         560
#define WPUB3                         561
#define WPUB4                         562
#define WPUB5                         563
#define WPUB6                         564
#define WPUB7                         565
#define WPUC                          566
#define WPUC0                         567
#define WPUC1                         568
#define WPUC2                         569
#define WPUC3                         570
#define WPUC4                         571
#define WPUC5                         572
#define WPUC6                         573
#define WPUC7                         574
#define WPUD                          575
#define WPUD0                         576
#define WPUD1                         577
#define WPUD2                         578
#define WPUD3                         579
#define WPUD4                         580
#define WPUD5                         581
#define WPUD6                         582
#define WPUD7                         583
#define WPUE                          584
#define WPUE0                         585
#define WPUE1                         586
#define WPUE2                         587
#define WPUE3                         588
#define SSP1BUF                       589
#define BUF                           590
#define BUF0                          591
#define SSP1BUF0                      592
#define BUF1                          593
#define SSP1BUF1                      594
#define BUF2                          595
#define SSP1BUF2                      596
#define BUF3                          597
#define SSP1BUF3                      598
#define BUF4                          599
#define SSP1BUF4                      600
#define BUF5                          601
#define SSP1BUF5                      602
#define BUF6                          603
#define SSP1BUF6                      604
#define BUF7                          605
#define SSP1BUF7                      606
#define ADD0                          607
#define ADD                           608
#define SSP1ADD0                      609
#define SSP1ADD                       610
#define ADD1                          611
#define SSP1ADD1                      612
#define ADD2                          613
#define SSP1ADD2                      614
#define ADD3                          615
#define SSP1ADD3                      616
#define ADD4                          617
#define SSP1ADD4                      618
#define ADD5                          619
#define SSP1ADD5                      620
#define ADD6                          621
#define SSP1ADD6                      622
#define ADD7                          623
#define SSP1ADD7                      624
#define SSP1MSK0                      625
#define SSP1MSK                       626
#define MSK0                          627
#define MSK                           628
#define SSP1MSK1                      629
#define MSK1                          630
#define SSP1MSK2                      631
#define MSK2                          632
#define SSP1MSK3                      633
#define MSK3                          634
#define SSP1MSK4                      635
#define MSK4                          636
#define SSP1MSK5                      637
#define MSK5                          638
#define SSP1MSK6                      639
#define MSK6                          640
#define SSP1MSK7                      641
#define MSK7                          642
#define SSP1STAT                      643
#define BF                            644
#define UA                            645
#define R_nW                          646
#define S                             647
#define P                             648
#define D_nA                          649
#define CKE                           650
#define SMP                           651
#define SSP1CON1                      652
#define SSPM0                         653
#define SSPM                          654
#define SSPM1                         655
#define SSPM2                         656
#define SSPM3                         657
#define CKP                           658
#define SSPEN                         659
#define SSPOV                         660
#define WCOL                          661
#define SSP1CON2                      662
#define SEN                           663
#define RSEN                          664
#define PEN                           665
#define RCEN                          666
#define ACKEN                         667
#define ACKDT                         668
#define ACKSTAT                       669
#define GCEN                          670
#define SSP1CON3                      671
#define DHEN                          672
#define AHEN                          673
#define SBCDE                         674
#define SDAHT                         675
#define BOEN                          676
#define SCIE                          677
#define PCIE                          678
#define ACKTIM                        679
#define ODCONA                        680
#define ODA0                          681
#define ODA1                          682
#define ODA2                          683
#define ODA3                          684
#define ODA4                          685
#define ODA5                          686
#define ODA6                          687
#define ODA7                          688
#define ODCONB                        689
#define ODB0                          690
#define ODB1                          691
#define ODB2                          692
#define ODB3                          693
#define ODB4                          694
#define ODB5                          695
#define ODB6                          696
#define ODB7                          697
#define ODCONC                        698
#define ODC0                          699
#define ODC1                          700
#define ODC2                          701
#define ODC3                          702
#define ODC4                          703
#define ODC5                          704
#define ODC6                          705
#define ODC7                          706
#define ODCOND                        707
#define ODD0                          708
#define ODD1                          709
#define ODD2                          710
#define ODD3                          711
#define ODD4                          712
#define ODD5                          713
#define ODD6                          714
#define ODD7                          715
#define ODCONE                        716
#define ODE0                          717
#define ODE1                          718
#define ODE2                          719
#define CCPR1L                        720
#define CCPR1H                        721
#define CCP1CON                       722
#define CCP1M0                        723
#define CCP1M                         724
#define CCP1M1                        725
#define CCP1M2                        726
#define CCP1M3                        727
#define CCP1Y                         728
#define DC1B                          729
#define DC1B0                         730
#define CCP1X                         731
#define DC1B1                         732
#define CCPR2L                        733
#define CCPR2H                        734
#define CCP2CON                       735
#define CCP2M                         736
#define CCP2M0                        737
#define CCP2M1                        738
#define CCP2M2                        739
#define CCP2M3                        740
#define DC2B0                         741
#define CCP2Y                         742
#define DC2B                          743
#define DC2B1                         744
#define CCP2X                         745
#define CCPTMRS                       746
#define C1TSEL0                       747
#define C1TSEL                        748
#define C1TSEL1                       749
#define C2TSEL0                       750
#define C2TSEL                        751
#define C2TSEL1                       752
#define P3TSEL                        753
#define P3TSEL0                       754
#define P3TSEL1                       755
#define P4TSEL0                       756
#define P4TSEL                        757
#define P4TSEL1                       758
#define SLRCONA                       759
#define SLRA0                         760
#define SLRA1                         761
#define SLRA2                         762
#define SLRA3                         763
#define SLRA4                         764
#define SLRA5                         765
#define SLRA6                         766
#define SLRA7                         767
#define SLRCONB                       768
#define SLRB0                         769
#define SLRB1                         770
#define SLRB2                         771
#define SLRB3                         772
#define SLRB4                         773
#define SLRB5                         774
#define SLRB6                         775
#define SLRB7                         776
#define SLRCONC                       777
#define SLRC0                         778
#define SLRC1                         779
#define SLRC2                         780
#define SLRC3                         781
#define SLRC4                         782
#define SLRC5                         783
#define SLRC6                         784
#define SLRC7                         785
#define SLRCOND                       786
#define SLRD0                         787
#define SLRD1                         788
#define SLRD2                         789
#define SLRD3                         790
#define SLRD4                         791
#define SLRD5                         792
#define SLRD6                         793
#define SLRD7                         794
#define SLRCONE                       795
#define SLRE0                         796
#define SLRE1                         797
#define SLRE2                         798
#define INLVLA                        799
#define INLVLA0                       800
#define INLVLA1                       801
#define INLVLA2                       802
#define INLVLA3                       803
#define INLVLA4                       804
#define INLVLA5                       805
#define INLVLA6                       806
#define INLVLA7                       807
#define INLVLB                        808
#define INLVLB0                       809
#define INLVLB1                       810
#define INLVLB2                       811
#define INLVLB3                       812
#define INLVLB4                       813
#define INLVLB5                       814
#define INLVLB6                       815
#define INLVLB7                       816
#define INLVLC                        817
#define INLVLC0                       818
#define INLVLC1                       819
#define INLVLC2                       820
#define INLVLC3                       821
#define INLVLC4                       822
#define INLVLC5                       823
#define INLVLC6                       824
#define INLVLC7                       825
#define INLVLD                        826
#define INLVLD0                       827
#define INLVLD1                       828
#define INLVLD2                       829
#define INLVLD3                       830
#define INLVLD4                       831
#define INLVLD5                       832
#define INLVLD6                       833
#define INLVLD7                       834
#define INLVLE                        835
#define INLVLE0                       836
#define INLVLE1                       837
#define INLVLE2                       838
#define INLVLE3                       839
#define IOCAP                         840
#define IOCAP0                        841
#define IOCAP1                        842
#define IOCAP2                        843
#define IOCAP3                        844
#define IOCAP4                        845
#define IOCAP5                        846
#define IOCAP6                        847
#define IOCAP7                        848
#define IOCAN                         849
#define IOCAN0                        850
#define IOCAN1                        851
#define IOCAN2                        852
#define IOCAN3                        853
#define IOCAN4                        854
#define IOCAN5                        855
#define IOCAN6                        856
#define IOCAN7                        857
#define IOCAF                         858
#define IOCAF0                        859
#define IOCAF1                        860
#define IOCAF2                        861
#define IOCAF3                        862
#define IOCAF4                        863
#define IOCAF5                        864
#define IOCAF6                        865
#define IOCAF7                        866
#define IOCBP                         867
#define IOCBP0                        868
#define IOCBP1                        869
#define IOCBP2                        870
#define IOCBP3                        871
#define IOCBP4                        872
#define IOCBP5                        873
#define IOCBP6                        874
#define IOCBP7                        875
#define IOCBN                         876
#define IOCBN0                        877
#define IOCBN1                        878
#define IOCBN2                        879
#define IOCBN3                        880
#define IOCBN4                        881
#define IOCBN5                        882
#define IOCBN6                        883
#define IOCBN7                        884
#define IOCBF                         885
#define IOCBF0                        886
#define IOCBF1                        887
#define IOCBF2                        888
#define IOCBF3                        889
#define IOCBF4                        890
#define IOCBF5                        891
#define IOCBF6                        892
#define IOCBF7                        893
#define IOCCP                         894
#define IOCCP0                        895
#define IOCCP1                        896
#define IOCCP2                        897
#define IOCCP3                        898
#define IOCCP4                        899
#define IOCCP5                        900
#define IOCCP6                        901
#define IOCCP7                        902
#define IOCCN                         903
#define IOCCN0                        904
#define IOCCN1                        905
#define IOCCN2                        906
#define IOCCN3                        907
#define IOCCN4                        908
#define IOCCN5                        909
#define IOCCN6                        910
#define IOCCN7                        911
#define IOCCF                         912
#define IOCCF0                        913
#define IOCCF1                        914
#define IOCCF2                        915
#define IOCCF3                        916
#define IOCCF4                        917
#define IOCCF5                        918
#define IOCCF6                        919
#define IOCCF7                        920
#define IOCEP                         921
#define IOCEP3                        922
#define IOCEN                         923
#define IOCEN3                        924
#define IOCEF                         925
#define IOCEF3                        926
#define TMR4                          927
#define PR4                           928
#define T4CON                         929
#define T4CKPS0                       930
#define T4CKPS                        931
#define T4CKPS1                       932
#define TMR4ON                        933
#define T4OUTPS                       934
#define T4OUTPS0                      935
#define T4OUTPS1                      936
#define T4OUTPS2                      937
#define T4OUTPS3                      938
#define TMR6                          939
#define PR6                           940
#define T6CON                         941
#define T6CKPS0                       942
#define T6CKPS                        943
#define T6CKPS1                       944
#define TMR6ON                        945
#define T6OUTPS0                      946
#define T6OUTPS                       947
#define T6OUTPS1                      948
#define T6OUTPS2                      949
#define T6OUTPS3                      950
#define NCO1ACCL                      951
#define NCO1ACCL_NCO1ACC              952
#define NCO1ACC0                      953
#define NCO1ACC1                      954
#define NCO1ACC2                      955
#define NCO1ACC3                      956
#define NCO1ACC4                      957
#define NCO1ACC5                      958
#define NCO1ACC6                      959
#define NCO1ACC7                      960
#define NCO1ACCH                      961
#define NCO1ACC8                      962
#define NCO1ACCH_NCO1ACC              963
#define NCO1ACC9                      964
#define NCO1ACC10                     965
#define NCO1ACC11                     966
#define NCO1ACC12                     967
#define NCO1ACC13                     968
#define NCO1ACC14                     969
#define NCO1ACC15                     970
#define NCO1ACCU                      971
#define NCO1ACCU_NCO1ACC              972
#define NCO1ACC16                     973
#define NCO1ACC17                     974
#define NCO1ACC18                     975
#define NCO1ACC19                     976
#define NCO1INCL                      977
#define NCO1INC0                      978
#define NCO1INCL_NCO1INC              979
#define NCO1INC1                      980
#define NCO1INC2                      981
#define NCO1INC3                      982
#define NCO1INC4                      983
#define NCO1INC5                      984
#define NCO1INC6                      985
#define NCO1INC7                      986
#define NCO1INCH                      987
#define NCO1INCH_NCO1INC              988
#define NCO1INC8                      989
#define NCO1INC9                      990
#define NCO1INC10                     991
#define NCO1INC11                     992
#define NCO1INC12                     993
#define NCO1INC13                     994
#define NCO1INC14                     995
#define NCO1INC15                     996
#define NCO1INCU                      997
#define NCO1INC16                     998
#define NCO1INCU_NCO1INC              999
#define NCO1INC17                     1000
#define NCO1INC18                     1001
#define NCO1INC19                     1002
#define NCO1CON                       1003
#define N1PFM                         1004
#define N1POL                         1005
#define N1OUT                         1006
#define N1EN                          1007
#define NCO1CLK                       1008
#define N1CKS                         1009
#define N1CKS0                        1010
#define N1CKS1                        1011
#define N1PWS0                        1012
#define N1PWS                         1013
#define N1PWS1                        1014
#define N1PWS2                        1015
#define OPA1CON                       1016
#define OPA1PCH                       1017
#define OPA1PCH0                      1018
#define OPA1PCH1                      1019
#define OPA1UG                        1020
#define OPA1SP                        1021
#define OPA1EN                        1022
#define OPA2CON                       1023
#define OPA2PCH                       1024
#define OPA2PCH0                      1025
#define OPA2PCH1                      1026
#define OPA2UG                        1027
#define OPA2SP                        1028
#define OPA2EN                        1029
#define PWM3DCL0                      1030
#define PWM3DCL                       1031
#define PWM3DCL1                      1032
#define PWM3DCH0                      1033
#define PWM3DCH                       1034
#define PWM3DCH1                      1035
#define PWM3DCH2                      1036
#define PWM3DCH3                      1037
#define PWM3DCH4                      1038
#define PWM3DCH5                      1039
#define PWM3DCH6                      1040
#define PWM3DCH7                      1041
#define PWM3CON                       1042
#define PWM3POL                       1043
#define PWM3OUT                       1044
#define PWM3EN                        1045
#define PWM4DCL                       1046
#define PWM4DCL0                      1047
#define PWM4DCL1                      1048
#define PWM4DCH0                      1049
#define PWM4DCH                       1050
#define PWM4DCH1                      1051
#define PWM4DCH2                      1052
#define PWM4DCH3                      1053
#define PWM4DCH4                      1054
#define PWM4DCH5                      1055
#define PWM4DCH6                      1056
#define PWM4DCH7                      1057
#define PWM4CON                       1058
#define PWM4POL                       1059
#define PWM4OUT                       1060
#define PWM4EN                        1061
#define COG1PHR                       1062
#define G1PHR                         1063
#define G1PHR0                        1064
#define G1PHR1                        1065
#define G1PHR2                        1066
#define G1PHR3                        1067
#define G1PHR4                        1068
#define G1PHR5                        1069
#define COG1PHF                       1070
#define G1PHF0                        1071
#define G1PHF                         1072
#define G1PHF1                        1073
#define G1PHF2                        1074
#define G1PHF3                        1075
#define G1PHF4                        1076
#define G1PHF5                        1077
#define COG1BLKR                      1078
#define G1BLKR                        1079
#define G1BLKR0                       1080
#define G1BLKR1                       1081
#define G1BLKR2                       1082
#define G1BLKR3                       1083
#define G1BLKR4                       1084
#define G1BLKR5                       1085
#define COG1BLKF                      1086
#define G1BLKF                        1087
#define G1BLKF0                       1088
#define G1BLKF1                       1089
#define G1BLKF2                       1090
