tiborsimon/embedded-tdd-headers/pic/pic16/pic16f1717_tdd.h
#define CLC3GLS1_D2T                  1649
#define LC3G2D3N                      1650
#define CLC3GLS1_D3N                  1651
#define CLC3GLS1_D3T                  1652
#define LC3G2D3T                      1653
#define LC3G2D4N                      1654
#define CLC3GLS1_D4N                  1655
#define LC3G2D4T                      1656
#define CLC3GLS1_D4T                  1657
#define CLC3GLS2                      1658
#define LC3G3D1N                      1659
#define CLC3GLS2_D1N                  1660
#define LC3G3D1T                      1661
#define CLC3GLS2_D1T                  1662
#define CLC3GLS2_D2N                  1663
#define LC3G3D2N                      1664
#define CLC3GLS2_D2T                  1665
#define LC3G3D2T                      1666
#define CLC3GLS2_D3N                  1667
#define LC3G3D3N                      1668
#define LC3G3D3T                      1669
#define CLC3GLS2_D3T                  1670
#define CLC3GLS2_D4N                  1671
#define LC3G3D4N                      1672
#define CLC3GLS2_D4T                  1673
#define LC3G3D4T                      1674
#define CLC3GLS3                      1675
#define LC3G4D1N                      1676
#define CLC3GLS3_G4D1N                1677
#define LC3G4D1T                      1678
#define CLC3GLS3_G4D1T                1679
#define LC3G4D2N                      1680
#define CLC3GLS3_G4D2N                1681
#define CLC3GLS3_G4D2T                1682
#define LC3G4D2T                      1683
#define LC3G4D3N                      1684
#define CLC3GLS3_G4D3N                1685
#define CLC3GLS3_G4D3T                1686
#define LC3G4D3T                      1687
#define LC3G4D4N                      1688
#define CLC3GLS3_G4D4N                1689
#define LC3G4D4T                      1690
#define CLC3GLS3_G4D4T                1691
#define CLC4CON                       1692
#define LC4MODE                       1693
#define CLC4CON_MODE                  1694
#define LC4MODE0                      1695
#define CLC4CON_MODE0                 1696
#define LC4MODE1                      1697
#define CLC4CON_MODE1                 1698
#define LC4MODE2                      1699
#define CLC4CON_MODE2                 1700
#define LC4INTN                       1701
#define CLC4CON_INTN                  1702
#define CLC4CON_INTP                  1703
#define LC4INTP                       1704
#define CLC4CON_OUT                   1705
#define LC4OUT                        1706
#define CLC4CON_EN                    1707
#define LC4EN                         1708
#define CLC4POL                       1709
#define CLC4POL_G1POL                 1710
#define LC4G1POL                      1711
#define CLC4POL_G2POL                 1712
#define LC4G2POL                      1713
#define CLC4POL_G3POL                 1714
#define LC4G3POL                      1715
#define LC4G4POL                      1716
#define CLC4POL_G4POL                 1717
#define LC4POL                        1718
#define CLC4POL_POL                   1719
#define CLC4SEL0                      1720
#define CLC4SEL0_D1S0                 1721
#define LC4D1S0                       1722
#define CLC4SEL0_D1S                  1723
#define LC4D1S                        1724
#define CLC4SEL0_D1S1                 1725
#define LC4D1S1                       1726
#define CLC4SEL0_D1S2                 1727
#define LC4D1S2                       1728
#define CLC4SEL0_D1S3                 1729
#define LC4D1S3                       1730
#define CLC4SEL0_D1S4                 1731
#define LC4D1S4                       1732
#define CLC4SEL1                      1733
#define LC4D2S                        1734
#define LC4D2S0                       1735
#define CLC4SEL1_D2S                  1736
#define CLC4SEL1_D2S0                 1737
#define LC4D2S1                       1738
#define CLC4SEL1_D2S1                 1739
#define LC4D2S2                       1740
#define CLC4SEL1_D2S2                 1741
#define LC4D2S3                       1742
#define CLC4SEL1_D2S3                 1743
#define LC4D2S4                       1744
#define CLC4SEL1_D2S4                 1745
#define CLC4SEL2                      1746
#define LC4D3S                        1747
#define CLC4SEL2_D3S                  1748
#define CLC4SEL2_D3S0                 1749
#define LC4D3S0                       1750
#define LC4D3S1                       1751
#define CLC4SEL2_D3S1                 1752
#define CLC4SEL2_D3S2                 1753
#define LC4D3S2                       1754
#define CLC4SEL2_D3S3                 1755
#define LC4D3S3                       1756
#define LC4D3S4                       1757
#define CLC4SEL2_D3S4                 1758
#define CLC4SEL3                      1759
#define LC4D4S0                       1760
#define LC4D4S                        1761
#define CLC4SEL3_D4S0                 1762
#define CLC4SEL3_D4S                  1763
#define LC4D4S1                       1764
#define CLC4SEL3_D4S1                 1765
#define LC4D4S2                       1766
#define CLC4SEL3_D4S2                 1767
#define LC4D4S3                       1768
#define CLC4SEL3_D4S3                 1769
#define LC4D4S4                       1770
#define CLC4SEL3_D4S4                 1771
#define CLC4GLS0                      1772
#define CLC4GLS0_D1N                  1773
#define LC4G1D1N                      1774
#define CLC4GLS0_D1T                  1775
#define LC4G1D1T                      1776
#define CLC4GLS0_D2N                  1777
#define LC4G1D2N                      1778
#define CLC4GLS0_D2T                  1779
#define LC4G1D2T                      1780
#define CLC4GLS0_D3N                  1781
#define LC4G1D3N                      1782
#define CLC4GLS0_D3T                  1783
#define LC4G1D3T                      1784
#define CLC4GLS0_D4N                  1785
#define LC4G1D4N                      1786
#define CLC4GLS0_D4T                  1787
#define LC4G1D4T                      1788
#define CLC4GLS1                      1789
#define CLC4GLS1_D1N                  1790
#define LC4G2D1N                      1791
#define CLC4GLS1_D1T                  1792
#define LC4G2D1T                      1793
#define LC4G2D2N                      1794
#define CLC4GLS1_D2N                  1795
#define LC4G2D2T                      1796
#define CLC4GLS1_D2T                  1797
#define CLC4GLS1_D3N                  1798
#define LC4G2D3N                      1799
#define LC4G2D3T                      1800
#define CLC4GLS1_D3T                  1801
#define CLC4GLS1_D4N                  1802
#define LC4G2D4N                      1803
#define CLC4GLS1_D4T                  1804
#define LC4G2D4T                      1805
#define CLC4GLS2                      1806
#define CLC4GLS2_D1N                  1807
#define LC4G3D1N                      1808
#define CLC4GLS2_D1T                  1809
#define LC4G3D1T                      1810
#define LC4G3D2N                      1811
#define CLC4GLS2_D2N                  1812
#define LC4G3D2T                      1813
#define CLC4GLS2_D2T                  1814
#define CLC4GLS2_D3N                  1815
#define LC4G3D3N                      1816
#define CLC4GLS2_D3T                  1817
#define LC4G3D3T                      1818
#define LC4G3D4N                      1819
#define CLC4GLS2_D4N                  1820
#define LC4G3D4T                      1821
#define CLC4GLS2_D4T                  1822
#define CLC4GLS3                      1823
#define CLC4GLS3_G4D1N                1824
#define LC4G4D1N                      1825
#define LC4G4D1T                      1826
#define CLC4GLS3_G4D1T                1827
#define LC4G4D2N                      1828
#define CLC4GLS3_G4D2N                1829
#define LC4G4D2T                      1830
#define CLC4GLS3_G4D2T                1831
#define CLC4GLS3_G4D3N                1832
#define LC4G4D3N                      1833
#define CLC4GLS3_G4D3T                1834
#define LC4G4D3T                      1835
#define LC4G4D4N                      1836
#define CLC4GLS3_G4D4N                1837
#define LC4G4D4T                      1838
#define CLC4GLS3_G4D4T                1839
#define STATUS_SHAD                   1840
#define C_SHAD                        1841
#define DC_SHAD                       1842
#define Z_SHAD                        1843
#define WREG_SHAD                     1844
#define BSR_SHAD                      1845
#define PCLATH_SHAD                   1846
#define FSR0L_SHAD                    1847
#define FSR0H_SHAD                    1848
#define FSR1L_SHAD                    1849
#define FSR1H_SHAD                    1850
#define STKPTR                        1851
#define TOSL                          1852
#define TOSH                          1853

#endif // _PIC16F1717_H_
